RIET/src/InformationRegisters/SettingsOfCustomsFilesToLawson/SettingsOfCustomsFilesToLawson.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SettingsOfCustomsFilesToLawson</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Type</name>
    <type>
      <types>EnumRef.TypesOfCustomsFilesUnloading</types>
    </type>
  </resources>
  <resources>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </resources>
  <resources>
    <name>Activity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SubAccount</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ParentCompany</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/SettingsOfCustomsFilesToLawson/ManagerModule.bsl
Функция ПолучитьSettings(Дата, ParentCompany) Экспорт
	
	// возвращает структуру настроек для выгрузки в lawson
	// если настроек нет - возвращает Неопределено
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		ВызватьИсключение "Date is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ParentCompany) Тогда
		ВызватьИсключение "Parent company is empty!";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ParentCompany", ParentCompany);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SettingsOfCustomsFilesToLawsonСрезПоследних.Type,
		|	SettingsOfCustomsFilesToLawsonСрезПоследних.AU,
		|	SettingsOfCustomsFilesToLawsonСрезПоследних.Activity,
		|	SettingsOfCustomsFilesToLawsonСрезПоследних.Account,
		|	SettingsOfCustomsFilesToLawsonСрезПоследних.SubAccount
		|ИЗ
		|	РегистрСведений.SettingsOfCustomsFilesToLawson.СрезПоследних(&Дата, ParentCompany = &ParentCompany) КАК SettingsOfCustomsFilesToLawsonСрезПоследних";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаСвойств = "Type, AU, Activity, Account, SubAccount";
	СтруктураВозврата = Новый Структура(СтрокаСвойств);
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка, СтрокаСвойств);
	
	Возврат СтруктураВозврата;
	
КонецФункции
